
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("Отбор");
	ПараметрыФормы.Отбор = Новый Структура("Дизайн",ПараметрКоманды);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии",Истина);
	ОткрытьФорму("Документ.мн_ЗаказФорм.ФормаСписка",ПараметрыФормы , ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);	
														  
КонецПроцедуры
