
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЗаполнитьФактическоеОтклонениеСервер(ПараметрКоманды);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФактическоеОтклонениеСервер(ПараметрКоманды)	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		Для каждого Эл из ПараметрКоманды Цикл
			Если Эл.ФорматПечати = Перечисления.ФорматПечати.Omet Тогда
				Об = Эл.ПолучитьОбъект();
			    Об.ФактическийРазмерМакета =  РасчетОтклоненияРазмераМакетаСервер(Об);
				Об.Записать();				
				Сообщить(Эл);
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры // ЗаполнитьФактическоеОтклонениеСервер()

&НаСервере
Функция РасчетОтклоненияРазмераМакетаСервер(обДизайн)
	Если НЕ ЗначениеЗаполнено(обДизайн.Вал) ИЛИ обДизайн.КоличествоНаРапорте = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Оттиск = Окр(обДизайн.Вал.ДлинаОкружности / обДизайн.КоличествоНаРапорте,2);
	Отклонение = Оттиск - обДизайн.ШагПечати;
	
	Если Отклонение > 0 Тогда
		Возврат Строка(Оттиск) + " (+"+Строка(Отклонение)+" мм.)";
	ИначеЕсли Отклонение < 0 Тогда
		Возврат Строка(Оттиск) + " (-"+Строка(Отклонение)+" мм.)";
	Иначе
		Возврат Строка(Оттиск);
	КонецЕсли;
КонецФункции // ДиаметрВала()
