
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СформироватьПриОткрытии",Истина);
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "ОтчетСОтборомПоДизайну");
	ПараметрыФормы.Вставить("КлючПользовательскойНастроек", Новый УникальныйИдентификатор);
	
	Отбор = Новый Структура;
	Отбор.Вставить("Дизайн",ПараметрКоманды);
	ПараметрыФормы.Вставить("Отбор",Отбор);
	
	ФормаОтчета = ОткрытьФорму("Отчет.мн_ПечатныеФормы.Форма.ФормаОтчета", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
