
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент;
	Печать(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСверху = 7;
	ТабДок.ПолеСправа = 7;
	ТабДок.ПолеСнизу  = 7;
	ТабДок.ПолеСлева = 7;
	
	ТабДок.ИмяПараметровПечати = "Дизайны_ПечатьТЗ";
	
	ПараметрыПечатногоДокумента = Новый Структура("ОтображатьЗаголовки, ОтображатьСетку, ТолькоПросмотр, Защита, ИмяПараметровПечати",Ложь,Ложь,Истина,Истина,"Дизайны_ПечатьТЗ");
	ПараметрыПечатногоДокумента.Вставить("ПолеСверху",7);
	ПараметрыПечатногоДокумента.Вставить("ПолеСнизу",7);
	ПараметрыПечатногоДокумента.Вставить("ПолеСлева",7);
	ПараметрыПечатногоДокумента.Вставить("ПолеСправа",7);	
	ПараметрыПечатногоДокумента.Вставить("АвтоМасштаб",Истина);
		
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ПараметрыПечатногоДокумента",ПараметрыПечатногоДокумента);
	ПараметрыПечати.Вставить("ТабДок",ТабДок);
	
	ОткрытьФорму("ОбщаяФорма.ФормаПечати",ПараметрыПечати);
	
КонецПроцедуры

&НаСервере
Функция Печать(ТабДок, ПараметрКоманды)

	ТабДок.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Дизайн_ПечатьТЗ";
	
	Макет = Справочники.мн_Дизайны.ПолучитьМакет("МакетТЗ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Дизайны.Владелец КАК Заказчик,
	               |	Дизайны.Репростудия,
	               |	Дизайны.ДатаДизайна КАК ДатаПоступления,
	               |	Дизайны.Менеджер,
	               |	Дизайны.КоличествоРучьев,
	               |	Дизайны.КолвоКлишеЛицо,
	               |	Дизайны.КолвоКлишеОборот,
	               |	Дизайны.Наименование,
	               |	Дизайны.НаправлениеПечати,
	               |	Дизайны.Примечание,
	               |	Дизайны.ШагПечати,
	               |	Дизайны.Вал КАК ДлинаВала,
	               |	Дизайны.Линиатура,
	               |	Дизайны.ТолщинаКлише,
	               |	Дизайны.Углы,
	               |	Дизайны.КоэффициентДисторсии,
	               |	Дизайны.ШиринаПечати,
	               |	Дизайны.Код КАК ИД,
	               |	Дизайны.Ссылка КАК Дизайн,
	               |	Дизайны.НазваниеДизайна,
	               |	Дизайны.ШиринаГП,
	               |	Дизайны.ШиринаПоВалу,
	               |	Дизайны.ТипКлише,
	               |	Дизайны.НаличиеМетки,
	               |	Дизайны.РазмерМетки КАК Фотометка,
	               |	Дизайны.ЛицоОборот КАК ЛицоОборот,
	               |	Дизайны.СхемаНамотки КАК СхемаНамотки,
	               |	Дизайны.РасположениеМетки КАК РасположениеМетки,
	               |	Дизайны.ЗапечатываемыйМатериал,
	               |	Дизайны.СтруктураКонечногоМатериала,
	               |	Дизайны.Цветопроба,
	               |	Дизайны.КоличествоНаРапорте,
	               |	Дизайны.ШиринаМатериала КАК ШиринаПланируемогоМатериала,
	               |	Дизайны.ШиринаВерсткиСОпорнымиПолосами,
	               |	Дизайны.ШиринаТиражногоМатериала КАК ШиринаТиражногоМатериала,
	               |	Дизайны.ПечатьСЗаказчиком,
	               |	Дизайны.ПечатьПоОбразуЗаказчика,
	               |	Дизайны.Технолог,
	               |	Дизайны.НаправлениеПечати КАК ТипПечати,
	               |	Дизайны.РазработкаОригиналМакета,
	               |	Дизайны.ВыводЦветопроб,
	               |	Дизайны.ВыводФлексФорм,
	               |	Дизайны.ДоработкаОригиналМакета,
	               |	Дизайны.ЦветопробаСогласоватьЗаказчик,
	               |	Дизайны.ПриводныеЭлементы,
	               |	Дизайны.ФорматПечати,
	               |	Дизайны.ТипПолимера,
	               |	Дизайны.ФактическийРазмерМакета
	               |ИЗ
	               |	Справочник.мн_Дизайны КАК Дизайны
	               |ГДЕ
	               |	Дизайны.Ссылка В(&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", ПараметрКоманды);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Область = Макет.ПолучитьОбласть("ОбластьТЗ");
	
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(Область.Параметры,Выборка);
		
		Область.Параметры.ДатаСоставления = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
		
		ТабДок.Вывести(Область);
		
	КонецЦикла;
	
КонецФункции // ПолучитьМакетТЗ()
