
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Справочник.мн_Дизайны.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	ПерезаполнитьИДДизайнаСервер(ПараметрКоманды);

КонецПроцедуры


// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ПерезаполнитьИДДизайнаСервер(ПараметрКоманды)

	Для каждого Дизайн из ПараметрКоманды Цикл
		ДизайнОбъект = Дизайн.ПолучитьОбъект();
		ДизайнОбъект.ИД = Прав(СокрЛП(ДизайнОбъект.Владелец.Код),5)+"-"+ ДизайнОбъект.Код;
		ДизайнОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры // ПерезаполнитьИДДизайна()
