
Процедура ОбработкаПроведения (Отказ, Режим)
    Если Организация.БИТ_ПроводитьВрунтреннююСертификацию И Дата>Организация.БИТ_ДатаНачалаДействияВнутреннейСертификации Тогда 
        Движения.БИТ_Карантин.Очистить();
        Движения.БИТ_Карантин.Записать();
        Движения.БИТ_ОтказСертификации.Очистить();
        Движения.БИТ_ОтказСертификации.Записать();
        Движения.БИТ_СтатусыСертификаций.Очистить();
        Движения.БИТ_СтатусыСертификаций.Записать();
        Движения.БИТ_СертификацияОстатки.Очистить();
        Движения.БИТ_СертификацияОстатки.Записать();
        
        Движения.БИТ_Карантин.Записывать = Истина;
        Движения.БИТ_СтатусыСертификаций.Записывать = Истина;
        Движения.БИТ_СертификацияОстатки.Записывать = Истина;
        Движения.БИТ_ОтказСертификации.Записывать = Истина;
        Для Каждого ТекСтрокаСерииНоменклатуры Из СерииНоменклатуры Цикл
            Если РезультатСертификации = Перечисления.БИТ_РезультатыСертификации.Сертификат ИЛИ РезультатСертификации = Перечисления.БИТ_РезультатыСертификации.ДопущенСОграничениями Тогда 
                Движение = Движения.БИТ_СертификацияОстатки.Добавить();
                Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
                Движение.Период = Дата;
                Движение.Номенклатура = ТекСтрокаСерииНоменклатуры.Номенклатура;
                Движение.Серия = ТекСтрокаСерииНоменклатуры.Серия;
                Движение.Склад = ТекСтрокаСерииНоменклатуры.Склад;
                Движение.Количество = ТекСтрокаСерииНоменклатуры.Количество; 
                Движение.Организация = Организация;
            ИначеЕсли РезультатСертификации = Перечисления.БИТ_РезультатыСертификации.ОтказаноВСертификации Тогда
                Движение = Движения.БИТ_ОтказСертификации.Добавить();
                Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
                Движение.Период = Дата;
                Движение.Номенклатура = ТекСтрокаСерииНоменклатуры.Номенклатура;
                Движение.Серия = ТекСтрокаСерииНоменклатуры.Серия;
                Движение.Склад = ТекСтрокаСерииНоменклатуры.Склад;
                Движение.Количество = ТекСтрокаСерииНоменклатуры.Количество; 
                Движение.Организация = Организация;
            КонецЕсли;
            
            Движение = Движения.БИТ_Карантин.Добавить();
            Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
            Движение.Период = Дата;
            Движение.Номенклатура = ТекСтрокаСерииНоменклатуры.Номенклатура;
            Движение.Серия = ТекСтрокаСерииНоменклатуры.Серия;
            Движение.Склад = ТекСтрокаСерииНоменклатуры.Склад;
            Движение.Количество = ТекСтрокаСерииНоменклатуры.Количество;
            Движение.Организация = Организация;
            
            
            
            Движение = Движения.БИТ_СтатусыСертификаций.Добавить();
            Движение.Период = Дата;
            Движение.Сертификация = ТекСтрокаСерииНоменклатуры.Сертификат;
            Движение.Статус = Перечисления.БИТ_СтатусыСертификаций.Отозван;
        КонецЦикла;
        
    КонецЕсли;
КонецПроцедуры

