
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ТабДок = Новый ТабличныйДокумент;
	Печать(ТабДок, ПараметрКоманды);
	ТабДок.КлючПараметровПечати = "КлючьПараметровПечати_ПаспортДизайна";
	
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку     = Ложь;	
	ТабДок.АвтоМасштаб         = Истина;
	ТабДок.ПолеСверху      = 5;
	ТабДок.ПолеСправа      = 5;
	ТабДок.ПолеСнизу       = 5;
	ТабДок.ПолеСлева       = 5;
	ТабДок.ВерхнийКолонтитул.Выводить = Ложь;
	ТабДок.НижнийКолонтитул.Выводить = Ложь;
	
	ФормаПечати = ОткрытьФорму("ОбщаяФорма.ФормаПечати",,,ПараметрыВыполненияКоманды.Уникальность,,ПараметрыВыполненияКоманды.НавигационнаяСсылка,);
	ФормаПечати.ТабДок = ТабДок;
	ФормаПечати.Заголовок = "Печать паспорта дизайна:";
	ФормаПечати.АвтоЗаголовок = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, ПараметрКоманды)
	Справочники.мн_Дизайны.ПечатьПаспорта(ТабДок, ПараметрКоманды);
КонецПроцедуры
