
&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
    ТипыРеквизита = Новый Массив;
    ТипыРеквизита.Добавить(Тип("Булево"));
    ОписаниеТиповДляРеквизита = Новый ОписаниеТипов(ТипыРеквизита);
    НовыйРеквизит = Новый РеквизитФормы("ТребуетсяВнутренняяСертификация", ОписаниеТиповДляРеквизита,, 
    "ТребуетсяВнутренняяСертификация",Истина);        
    
    ДобавляемыеРеквизиты = Новый Массив;
    ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ТипыРеквизита = Новый Массив;
    ТипыРеквизита.Добавить(Тип("Булево"));
    ОписаниеТиповДляРеквизита = Новый ОписаниеТипов(ТипыРеквизита);
    НовыйРеквизит = Новый РеквизитФормы("СКолес", ОписаниеТиповДляРеквизита,, 
    "СКолес",Истина);
    ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
    ИзменитьРеквизиты(ДобавляемыеРеквизиты);
    
    НовыйЭлемент = Элементы.Добавить("БИТ_ТребуетсяВнутренняяСертификация", Тип("ПолеФормы"),Элементы.АртикулКодШтрихкод);  
    НовыйЭлемент.ПутьКДанным = "Объект.БИТ_ТребуетсяВнутренняяСертификация";
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.УстановитьДействие("ПриИзменении","БИТ_ТребуетсяВнутренняяСертификация_ПриИзменении");
	
	НовыйЭлемент = Элементы.Добавить("БИТ_СКолес", Тип("ПолеФормы"),Элементы.АртикулКодШтрихкод);  
    НовыйЭлемент.ПутьКДанным = "Объект.БИТ_СКолес";
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	Если НЕ Объект.БИТ_ТребуетсяВнутренняяСертификация Тогда
		НовыйЭлемент.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура БИТ_ТребуетсяВнутренняяСертификация_ПриИзменении()

	Если НЕ Объект.БИТ_ТребуетсяВнутренняяСертификация Тогда
		Элементы.БИТ_СКолес.Видимость = Ложь;
		Объект.БИТ_СКолес = Ложь;
	Иначе
		Элементы.БИТ_СКолес.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры 
