
&НаКлиенте
Процедура ОтображатьАрхивныеПриИзменении(Элемент)
	
	ОтобразитьАрхивные(ОтображатьАрхивные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьАрхивные(ОтображатьАрхивные)
	
	ПолеКомпановки = Новый ПолеКомпоновкиДанных("Архивный");
	
	Для Каждого Эл из Список.Отбор.Элементы Цикл
		Если ТипЗнч(Эл)= Тип("ЭлементОтбораКомпоновкиДанных")  И Эл.ЛевоеЗначение = ПолеКомпановки Тогда
			Эл.Использование = НЕ ОтображатьАрхивные;		
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры // ОтобразитьАрхивные()

&НаКлиенте
Процедура СгруппироватьПоКонтрагенту(Команда)
	
	ЭлементыГруппировки = Список.Группировка.Элементы; 
	ПолеВладелец = Новый ПолеКомпоновкиДанных("Владелец");
	ПолеГруппировки = Неопределено;
	
	Для каждого ЭлементГруппировки из ЭлементыГруппировки Цикл		
		Если ТипЗнч(ЭлементГруппировки) = Тип("ПолеГруппировкиКомпоновкиДанных") И
			ЭлементГруппировки.Поле = ПолеВладелец Тогда
			ПолеГруппировки = ЭлементГруппировки;
			Прервать;
		КонецЕсли;		
	КонецЦикла;
	
	Если ПолеГруппировки = Неопределено Тогда
		ЭлементыГруппировки.Очистить();		
		ПолеГруппировки = ЭлементыГруппировки.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле = ПолеВладелец;
		ПолеГруппировки.Использование = Истина;		
		Элементы.СгруппироватьПоКонтрагенту.Пометка = Истина;
	Иначе 
		ЭлементыГруппировки.Очистить();
		Элементы.СгруппироватьПоКонтрагенту.Пометка = Ложь;
	КонецЕсли;
		

КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	
	Отбор = Список.Отбор;
	Для каждого Элемент Из Отбор.Элементы Цикл
	
		Если Элемент.Представление = "ОтборПоПодстроке" Тогда
			Если ЗначениеЗаполнено(СтрокаПоиска) Тогда
			
				Для каждого ЭлементОтбора из Элемент.Элементы Цикл
					ЭлементОтбора.ПравоеЗначение = СтрокаПоиска;				
				КонецЦикла;
				
				Элемент.Использование = Истина;				
				
			Иначе 
				Элемент.Использование = Ложь;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры
