
Процедура ПечатьПаспорта(МассивОбъектов, ПараметрыПечати) Экспорт

	ТабДок = МассивОбъектов;
	ТабДок.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Дизайн_Паспорт";
	
	
	Макет = Справочники.мн_Дизайны.ПолучитьМакет("Паспорт");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Дизайны.Владелец КАК Заказчик,
	               |	Дизайны.ДатаДизайна КАК ДатаПоступления,
	               |	Дизайны.КоличествоРучьев,
	               |	Дизайны.КолвоКлишеЛицо,
	               |	Дизайны.КолвоКлишеОборот,
	               |	Дизайны.Наименование,
	               |	Дизайны.НаправлениеПечати,
	               |	Дизайны.Примечание,
	               |	Дизайны.ШагПечати,
	               |	Дизайны.Вал,
	               |	Дизайны.Линиатура,
	               |	Дизайны.ТолщинаКлише,
	               |	Дизайны.Углы,
	               |	Дизайны.КоэффициентДисторсии,
	               |	Дизайны.ШиринаВерсткиСОпорнымиПолосами,
	               |	Дизайны.ШиринаПечати,
	               |	Дизайны.Код КАК ИД,
	               |	Дизайны.Ссылка КАК Дизайн,
	               |	Дизайны.РазмерМетки КАК Фотометка,
	               |	Дизайны.НазваниеДизайна,
	               |	Дизайны.ШиринаТиражногоМатериала,
	               |	Дизайны.ШиринаГП,
	               |	Дизайны.Репростудия,
	               |	КоличествоГодныхФорм.КоличествоФорм
	               |ИЗ
	               |	Справочник.мн_Дизайны КАК Дизайны
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГодныеФормы.НомерКлише) КАК КоличествоФорм,
	               |			ГодныеФормы.Дизайн КАК Дизайн
	               |		ИЗ
	               |			(ВЫБРАТЬ
	               |				ПечатныеФормыСрезПоследних.НомерКлише КАК НомерКлише,
	               |				ПечатныеФормыСрезПоследних.Дизайн КАК Дизайн,
	               |				ПечатныеФормыСрезПоследних.Состояние КАК Состояние
	               |			ИЗ
	               |				РегистрСведений.мн_ПечатныеФормы.СрезПоследних(, Дизайн В (&Ссылка)) КАК ПечатныеФормыСрезПоследних
	               |			ГДЕ
	               |				ПечатныеФормыСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостояниеКлише.Годный)) КАК ГодныеФормы
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ГодныеФормы.Дизайн) КАК КоличествоГодныхФорм
	               |		ПО Дизайны.Ссылка = КоличествоГодныхФорм.Дизайн
	               |ГДЕ
	               |	Дизайны.Ссылка В(&Ссылка)";

	Запрос.Параметры.Вставить("Ссылка", ПараметрыПечати);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка  = Макет.ПолучитьОбласть("Заголовок");
	Детали = Макет.ПолучитьОбласть("Детали");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);

		ТабДок.Вывести(ОбластьЗаголовок);
		
		//ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ШапкаТаблицы  = Макет.ПолучитьОбласть("ШапкаТаблицы");
		
		Детали        = Макет.ПолучитьОбласть("Детали");
		
		ТабДок.Вывести(ШапкаТаблицы);
				
		ЗапросКлише = Новый Запрос;
		ЗапросКлише.Текст = 
		"ВЫБРАТЬ
		|	ПечатныеФормыСрезПоследних.ЦветКлише,
		|	ПечатныеФормыСрезПоследних.НомерКлише,
		|	ПечатныеФормыСрезПоследних.НомерКлише.ДатаПоступления КАК ДатаПоступления,
		|	ПечатныеФормыСрезПоследних.Состояние,
		|	ПечатныеФормыСрезПоследних.Размещение КАК Секция,
		|	ПечатныеФормыСрезПоследних.НомерКлише.ТипПолимера КАК ТипПолимера
		|ИЗ
		|	РегистрСведений.мн_ПечатныеФормы.СрезПоследних(
		|			,
		|			ЦветКлише В
		|				(ВЫБРАТЬ
		|					КлишеЛицо.ВидКлише КАК ЦветКлише
		|				ИЗ
		|					Справочник.мн_Дизайны.КлишеЛицо КАК КлишеЛицо
		|				ГДЕ
		|					КлишеЛицо.Ссылка = &Дизайн
		|			
		|				ОБЪЕДИНИТЬ ВСЕ
		|			
		|				ВЫБРАТЬ
		|					КлишеОборот.ВидКлише
		|				ИЗ
		|					Справочник.мн_Дизайны.КлишеОборот КАК КлишеОборот
		|				ГДЕ
		|					КлишеОборот.Ссылка = &Дизайн)) КАК ПечатныеФормыСрезПоследних
		|ГДЕ
		|	ПечатныеФормыСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостояниеКлише.Годный)
		|	И ПечатныеФормыСрезПоследних.Активность = ИСТИНА";
		
		ЗапросКлише.УстановитьПараметр("Дизайн", Выборка.Дизайн);
		ЗапросКлише.УстановитьПараметр("Состояние", Перечисления.СостояниеКлише.Годный);
		
		РезультатЗапроса = ЗапросКлише.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		НомерСтроки = 1;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(Детали.Параметры ,ВыборкаДетальныеЗаписи);
			
			Детали.Параметры.НомерСтроки = НомерСтроки;
			
			ТабДок.Вывести(Детали);
			
			НомерСтроки = НомерСтроки +1;
			
		КонецЦикла;
		
		ПодвалТаблицы  = Макет.ПолучитьОбласть("ПодвалТаблицы");
		
		ТабДок.Вывести(ПодвалТаблицы);
		
		ТабДок.Вывести(Подвал);
		
		ШапкаДатыЭксплуатации = Макет.ПолучитьОбласть("ШапкаДатыЭксплуатации");
		СтрокаДатаЭксплуатации = Макет.ПолучитьОбласть("СтрокаДатаЭксплуатации");
		
		ТабДок.Вывести(ШапкаДатыЭксплуатации);
		
		Для Инд = 0 По 9 Цикл
		
			ТабДок.Вывести(СтрокаДатаЭксплуатации);
		
		КонецЦикла;
		
		ВставлятьРазделительСтраниц = Истина;

	КонецЦикла;

КонецПроцедуры

Функция ПечатьПаспорт(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Дизайн_Паспорт";
	
	Макет1 = Справочники.мн_Дизайны.ПолучитьМакет("Паспорт");
	
	ОбластьЗаголовок     = Макет1.ПолучитьОбласть("Заголовок");
	ОбластьПодвал        = Макет1.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы  = Макет1.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет1.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет1.ПолучитьОбласть("Детали");

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Дизайны.Код,
		|	Дизайны.Наименование,
		|	Дизайны.Владелец КАК Заказчик,
		|	Дизайны.Секция,
		|	Дизайны.Вал,
		|	Дизайны.КоличествоРучьев,
		|	Дизайны.ТолщинаКлише,
		|	Дизайны.КоличествоЦветов,
		|	Дизайны.Линиатура,
		|	Дизайны.НаправлениеПечати,
		|	Дизайны.ШагПечати,
		|	Дизайны.ШиринаПечати,
		|	Дизайны.ШиринаРучья,
		|	Дизайны.Углы,
		|	Дизайны.Примечание,
		|   Дизайны.ИД,
		|	Дизайны.КоэффициентДисторсии,
		|	Дизайны.ДатаПоступления
		|ИЗ
		|	Справочник.мн_Дизайны КАК Дизайны
		|ГДЕ
		|	Дизайны.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов[0].Ссылка);

	Результат = Запрос.Выполнить().Выбрать();

	ТабДок.Очистить();
	
	Результат.Следующий();
	
	ОбластьЗаголовок.Параметры.Заполнить(Результат);
	//ОбластьЗаголовок.Параметры.Заполнить();
	ИД = Результат.ИД;
	ОбластьЗаголовок.Параметры.ИД = СТрЗаменить(ИД," ","");
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();

	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Клише.Ссылка,
	               |	Клише.Код,
	               |	Клише.Предопределенный,
	               |	Клише.Цвет КАК Цвет,
	               |	Клише.ДатаПолучения КАК ДатаПолучения,
	               |	Клише.Списано,
	               |	Клише.Изготовитель,
	               |	Клише.Примечание
	               |ИЗ
	               |	Справочник.мн_Клише КАК Клише
	               |ГДЕ
	               |	Клише.Владелец = &Ссылка
	               |	И Клише.Списано = ЛОЖЬ
	               |	И Клише.ПометкаУдаления = ЛОЖЬ
	               |	И Клише.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаПолучения,
	               |	Цвет
	               |АВТОУПОРЯДОЧИВАНИЕ" ;
				   
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();

	НомерСтроки = 1;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ОбластьДетальныхЗаписей.Параметры.НомерСтроки = НомерСтроки;
		
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		
		ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
		
		НомерСтроки = НомерСтроки + 1;

	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	
	НомерСтрокиНачало = 1;
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, НомерСтрокиНачало, ОбъектыПечати, МассивОбъектов[0].Ссылка);
	
	Возврат ТабДок;
	
КонецФункции

Функция ПроверкаГодностиКомплектаФорм(СсылкаНаДизайн) Экспорт

	СтруктураОтвета = Новый Структура("Статус,ЦветСтатуса");
	Если СсылкаНаДизайн.КлишеЛицо.Количество() = 0 Тогда
		СтруктураОтвета.Статус = "Комплект форм отсутствует!";
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	Текст = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
		|	мн_ДизайныЦветаКлише.Ссылка КАК Ссылка,
		|	мн_ДизайныЦветаКлише.ВидКлише КАК ВидКлише
		|ПОМЕСТИТЬ Цвета
		|ИЗ
		|	Справочник.мн_Дизайны.ЦветаКлише КАК мн_ДизайныЦветаКлише
		|ГДЕ
		|	мн_ДизайныЦветаКлише.Ссылка = &Ссылка
		|   И мн_ДизайныЦветаКлише.ВидКлише <> ЗНАЧЕНИЕ(Справочник.мн_ЦветаКлишеДизайнов.ПустаяСсылка)		
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПечатныеФормы.НомерКлише,
		|	ПечатныеФормы.ЦветКлише,
		|	ПечатныеФормы.Состояние,
		|	ПечатныеФормы.НомерКлише.ДатаПоступления,
		|	ПечатныеФормы.НомерКлише.ДатаСписания,
		|	РАЗНОСТЬДАТ(ПечатныеФормы.НомерКлише.ДатаПоступления, НАЧАЛОПЕРИОДА(&ТекДата, ДЕНЬ), ДЕНЬ) КАК СрокХранения,
		|	ЕСТЬNULL(мн_ПечатныеФормыНаработкаОстатки.НаработкаОттисковОстаток, 0) КАК КоличествоОттисков
		|ПОМЕСТИТЬ Клише
		|ИЗ
		|	РегистрСведений.мн_ПечатныеФормы.СрезПоследних(
		|			,
		|			ЦветКлише В
		|				(ВЫБРАТЬ
		|					Цвета.ВидКлише
		|				ИЗ
		|					Цвета КАК Цвета)) КАК ПечатныеФормы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.мн_ПечатныеФормыНаработка.Остатки(
		|				,
		|				ПечатнаяФорма.ЦветКлише В
		|					(ВЫБРАТЬ
		|						Цвета.ВидКлише
		|					ИЗ
		|						Цвета КАК Цвета)) КАК мн_ПечатныеФормыНаработкаОстатки
		|		ПО ПечатныеФормы.НомерКлише = мн_ПечатныеФормыНаработкаОстатки.ПечатнаяФорма
		|ГДЕ
		|	ПечатныеФормы.Состояние = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.СостояниеКлише.Годный)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Цвета.ВидКлише,
		|	ЕСТЬNULL(Клише.НомерКлише, НЕОПРЕДЕЛЕНО) КАК ПечатнаяФорма
		|ИЗ
		|	Цвета КАК Цвета
		|		ЛЕВОЕ СОЕДИНЕНИЕ Клише КАК Клише
		|		ПО Цвета.ВидКлише = Клише.ЦветКлише
		|ГДЕ
		|	Клише.НомерКлише ЕСТЬ NULL 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(Клише.СрокХранения), 0) КАК СрокХранения
		|ИЗ
		|	Клише КАК Клише
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(Клише.КоличествоОттисков), 0) КАК КоличествоОттисков
		|ИЗ
		|	Клише КАК Клише";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДизайн);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	КомплектацияФорм = РезультатЗапроса[2].Выбрать();
	
	Если КомплектацияФорм.Количество() > 0 Тогда
		СтруктураОтвета.Статус = "Некомплект форм. ";
		СтруктураОтвета.ЦветСтатуса = WebЦвета.Красный; 
		Возврат СтруктураОтвета;			
	КонецЕсли;

	СрокХранения = РезультатЗапроса[3].Выбрать();
	
	//
	Если СрокХранения.Количество() = 1 Тогда 
		
		СрокХранения.Следующий();
		
		Если СрокХранения.СрокХранения > 547 Тогда
			СтруктураОтвета.Статус = "Комплект хранится " + СрокХранения.СрокХранения +" (дней). Превышен допустимый срох хранения.";	
			СтруктураОтвета.ЦветСтатуса = WebЦвета.Красный; 
			Возврат СтруктураОтвета;			
		КонецЕсли;

	КонецЕсли;
	
	Наработка = РезультатЗапроса[4].Выбрать();
	
	Если Наработка.Количество() = 1 Тогда 
		
		Наработка.Следующий();
		
		Если Наработка.КоличествоОттисков > 500000 Тогда
			СтруктураОтвета.Статус = "Формы выработали ресур по количеству оттисков " +Наработка.КоличествоОттисков+" . ";	
			СтруктураОтвета.ЦветСтатуса = WebЦвета.Красный; 
			Возврат СтруктураОтвета;
		КонецЕсли;

	КонецЕсли;
	
	Текст = "Комплект форм пригоден";
	СтруктураОтвета.ЦветСтатуса = WebЦвета.Зеленый;
	СтруктураОтвета.Статус = Текст;	
	Возврат СтруктураОтвета;	

КонецФункции // ПроверкаГодностиКомплектаФорм()

// Функция возвращает заказ ипокупателя и дизайн, на вход получает заказ на производство
// Параметры:
//  Заказ  - ДокументСсылка.ЗаказНаПроизводство - Ссылка на исходный заказ на производство
//
// Возвращаемое значение:
//   Структура   - Структура -  Структура содержащая Дизайн и Заказ - заказ покупателя ссылка
//
Функция ПолучитьЗаказДизайн(Заказ) Экспорт

	Структура = Новый Структура("Дизайн, Заказ");
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаПроизводствоПродукция.Номенклатура,
		|	ЗаказНаПроизводствоПродукция.ХарактеристикаНоменклатуры,
		|	ЗаказНаПроизводствоПродукция.Заказ,
		|	ЗаказНаПроизводствоПродукция.Спецификация,
		|	ЗаказНаПроизводствоПродукция.Ссылка КАК Ссылка,
		|	1 КАК Уровень
		|ПОМЕСТИТЬ ВТ_1
		|ИЗ
		|	Документ.ЗаказНаПроизводство.Продукция КАК ЗаказНаПроизводствоПродукция
		|ГДЕ
		|	ЗаказНаПроизводствоПродукция.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказНаПроизводствоПродукция.Номенклатура,
		|	ЗаказНаПроизводствоПродукция.ХарактеристикаНоменклатуры,
		|	ЗаказНаПроизводствоПродукция.Спецификация,
		|	ЗаказНаПроизводствоПродукция.Заказ,
		|	ЗаказНаПроизводствоПродукция.Ссылка,
		|	2 КАК Уровень
		|ПОМЕСТИТЬ ВТ_2
		|ИЗ
		|	Документ.ЗаказНаПроизводство.Продукция КАК ЗаказНаПроизводствоПродукция
		|ГДЕ
		|	ЗаказНаПроизводствоПродукция.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_1.Заказ
		|			ИЗ
		|				ВТ_1 КАК ВТ_1)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказНаПроизводствоПродукция.Номенклатура,
		|	ЗаказНаПроизводствоПродукция.ХарактеристикаНоменклатуры,
		|	ЗаказНаПроизводствоПродукция.Спецификация,
		|	ЗаказНаПроизводствоПродукция.Заказ,
		|	ЗаказНаПроизводствоПродукция.Ссылка,
		|	3 КАК Уровень
		|ПОМЕСТИТЬ ВТ_3
		|ИЗ
		|	Документ.ЗаказНаПроизводство.Продукция КАК ЗаказНаПроизводствоПродукция
		|ГДЕ
		|	ЗаказНаПроизводствоПродукция.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_2.Заказ
		|			ИЗ
		|				ВТ_2 КАК ВТ_2)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказНаПроизводствоПродукция.Номенклатура,
		|	ЗаказНаПроизводствоПродукция.ХарактеристикаНоменклатуры,
		|	ЗаказНаПроизводствоПродукция.Спецификация,
		|	ЗаказНаПроизводствоПродукция.Заказ,
		|	ЗаказНаПроизводствоПродукция.Ссылка,
		|	4 КАК Уровень
		|ПОМЕСТИТЬ ВТ_4
		|ИЗ
		|	Документ.ЗаказНаПроизводство.Продукция КАК ЗаказНаПроизводствоПродукция
		|ГДЕ
		|	ЗаказНаПроизводствоПродукция.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_3.Заказ
		|			ИЗ
		|				ВТ_3 КАК ВТ_3)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказНаПроизводствоПродукция.Номенклатура,
		|	ЗаказНаПроизводствоПродукция.ХарактеристикаНоменклатуры,
		|	ЗаказНаПроизводствоПродукция.Спецификация,
		|	ЗаказНаПроизводствоПродукция.Заказ,
		|	ЗаказНаПроизводствоПродукция.Ссылка,
		|	5 КАК Уровень
		|ПОМЕСТИТЬ ВТ_5
		|ИЗ
		|	Документ.ЗаказНаПроизводство.Продукция КАК ЗаказНаПроизводствоПродукция
		|ГДЕ
		|	ЗаказНаПроизводствоПродукция.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_4.Заказ
		|			ИЗ
		|				ВТ_4 КАК ВТ_4)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказНаПроизводствоПродукция.Номенклатура,
		|	ЗаказНаПроизводствоПродукция.ХарактеристикаНоменклатуры,
		|	ЗаказНаПроизводствоПродукция.Спецификация,
		|	ЗаказНаПроизводствоПродукция.Заказ,
		|	ЗаказНаПроизводствоПродукция.Ссылка,
		|	6 КАК Уровень
		|ПОМЕСТИТЬ ВТ_6
		|ИЗ
		|	Документ.ЗаказНаПроизводство.Продукция КАК ЗаказНаПроизводствоПродукция
		|ГДЕ
		|	ЗаказНаПроизводствоПродукция.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_5.Заказ
		|			ИЗ
		|				ВТ_5 КАК ВТ_5)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказНаПроизводствоПродукция.Номенклатура,
		|	ЗаказНаПроизводствоПродукция.ХарактеристикаНоменклатуры,
		|	ЗаказНаПроизводствоПродукция.Спецификация,
		|	ЗаказНаПроизводствоПродукция.Заказ,
		|	ЗаказНаПроизводствоПродукция.Ссылка,
		|	7 КАК Уровень
		|ПОМЕСТИТЬ ВТ_7
		|ИЗ
		|	Документ.ЗаказНаПроизводство.Продукция КАК ЗаказНаПроизводствоПродукция
		|ГДЕ
		|	ЗаказНаПроизводствоПродукция.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_6.Заказ
		|			ИЗ
		|				ВТ_6 КАК ВТ_6)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_1.Уровень КАК Уровень,
		|	ВТ_1.Ссылка КАК Ссылка,
		|	ВТ_1.Заказ КАК Заказ,
		|	ВТ_1.Номенклатура КАК Номенклатура,
		|	ВТ_1.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_1.Спецификация КАК Спецификация
		|ПОМЕСТИТЬ ВТ_Заказы
		|ИЗ
		|	ВТ_1 КАК ВТ_1
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_1.Заказ,
		|	ВТ_1.Номенклатура,
		|	ВТ_1.Спецификация,
		|	ВТ_1.Ссылка,
		|	ВТ_1.Уровень,
		|	ВТ_1.ХарактеристикаНоменклатуры
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_2.Уровень,
		|	ВТ_2.Ссылка,
		|	ВТ_2.Заказ,
		|	ВТ_2.Номенклатура,
		|	ВТ_2.ХарактеристикаНоменклатуры,
		|	ВТ_2.Спецификация
		|ИЗ
		|	ВТ_2 КАК ВТ_2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_3.Уровень,
		|	ВТ_3.Ссылка,
		|	ВТ_3.Заказ,
		|	ВТ_3.Номенклатура,
		|	ВТ_3.ХарактеристикаНоменклатуры,
		|	ВТ_3.Спецификация
		|ИЗ
		|	ВТ_3 КАК ВТ_3
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_4.Уровень,
		|	ВТ_4.Ссылка,
		|	ВТ_4.Заказ,
		|	ВТ_4.Номенклатура,
		|	ВТ_4.ХарактеристикаНоменклатуры,
		|	ВТ_4.Спецификация
		|ИЗ
		|	ВТ_4 КАК ВТ_4
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_5.Уровень,
		|	ВТ_5.Ссылка,
		|	ВТ_5.Заказ,
		|	ВТ_5.Номенклатура,
		|	ВТ_5.ХарактеристикаНоменклатуры,
		|	ВТ_5.Спецификация
		|ИЗ
		|	ВТ_5 КАК ВТ_5
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_6.Уровень,
		|	ВТ_6.Ссылка,
		|	ВТ_6.Заказ,
		|	ВТ_6.Номенклатура,
		|	ВТ_6.ХарактеристикаНоменклатуры,
		|	ВТ_6.Спецификация
		|ИЗ
		|	ВТ_6 КАК ВТ_6
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_7.Уровень,
		|	ВТ_7.Ссылка,
		|	ВТ_7.Заказ,
		|	ВТ_7.Номенклатура,
		|	ВТ_7.ХарактеристикаНоменклатуры,
		|	ВТ_7.Спецификация
		|ИЗ
		|	ВТ_7 КАК ВТ_7
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Заказы.Уровень КАК Уровень,
		|	ВТ_Заказы.Ссылка,
		|	ВТ_Заказы.Заказ,
		|	ВТ_Заказы.Номенклатура,
		|	ВТ_Заказы.ХарактеристикаНоменклатуры,
		|	ВТ_Заказы.Спецификация
		|ПОМЕСТИТЬ ВТ_ЗаказыПокупателя
		|ИЗ
		|	ВТ_Заказы КАК ВТ_Заказы
		|ГДЕ
		|	ВТ_Заказы.Заказ ССЫЛКА Документ.ЗаказПокупателя
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Заказы.Уровень,
		|	ВТ_Заказы.Ссылка,
		|	ВТ_Заказы.Заказ,
		|	ВТ_Заказы.Номенклатура,
		|	ВТ_Заказы.ХарактеристикаНоменклатуры,
		|	ВТ_Заказы.Спецификация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Заказы.Уровень,
		|	ВТ_Заказы.Ссылка,
		|	ВТ_Заказы.Заказ,
		|	ВТ_Заказы.Номенклатура,
		|	ВТ_Заказы.ХарактеристикаНоменклатуры,
		|	ВТ_Заказы.Спецификация
		|ИЗ
		|	ВТ_Заказы КАК ВТ_Заказы
		|ГДЕ
		|	ВТ_Заказы.Заказ ССЫЛКА Документ.ВнутреннийЗаказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПокупателяТовары.Ссылка КАК Заказ,
		|	ЗаказПокупателяТовары.мнДизайн КАК Дизайн
		|ИЗ
		|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|ГДЕ
		|	(ЗаказПокупателяТовары.Ссылка, ЗаказПокупателяТовары.Номенклатура, ЗаказПокупателяТовары.ХарактеристикаНоменклатуры) В
		|			(ВЫБРАТЬ
		|				ВТ_ЗаказыПокупателя.Заказ,
		|				ВТ_ЗаказыПокупателя.Номенклатура,
		|				ВТ_ЗаказыПокупателя.ХарактеристикаНоменклатуры
		|			ИЗ
		|				ВТ_ЗаказыПокупателя КАК ВТ_ЗаказыПокупателя)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВнутреннийЗаказТовары.Ссылка,
		|	ВнутреннийЗаказТовары.мнДизайн
		|ИЗ
		|	Документ.ВнутреннийЗаказ.Товары КАК ВнутреннийЗаказТовары
		|ГДЕ
		|	(ВнутреннийЗаказТовары.Ссылка, ВнутреннийЗаказТовары.Номенклатура, ВнутреннийЗаказТовары.ХарактеристикаНоменклатуры) В
		|			(ВЫБРАТЬ
		|				ВТ_ЗаказыПокупателя.Заказ,
		|				ВТ_ЗаказыПокупателя.Номенклатура,
		|				ВТ_ЗаказыПокупателя.ХарактеристикаНоменклатуры
		|			ИЗ
		|				ВТ_ЗаказыПокупателя КАК ВТ_ЗаказыПокупателя)";
	
	Запрос.УстановитьПараметр("Ссылка", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Структура,ВыборкаДетальныеЗаписи);	
	КонецЦикла;

	Возврат Структура;

КонецФункции // ПолучитьЗаказДизайн()


//====================Нормативы расхода краски =================

// Функция возвращает нормативы расхода краски для комлектов клише ЛИЦА и ОБОРОТА
// ЛицоОборот - Истина , если Ложь то оборот 
// Возвращаемое значение:
//   НормыРасходаКрасок - Структура содержащая норму РасходКраски и РасходКраскиСухойОстаток заказ покупателя ссылка
//
функция ПолучитьНормуРасходаКрасок(Дизайн, ЛицоОборот = Неопределено) Экспорт	
	
	Если ЛицоОборот = Неопределено Тогда
		ЛицоОборот = Перечисления.мн_НанесениеПечати.Лицо;
	КонецЕсли;
		
	
	НормыРасходаКрасок = Новый Структура("РасходКраски,РасходКраскиСухойОстаток",0,0);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Комплект.НомерСтроки,
		|	Комплект.ВидКлише,
		|	ЕСТЬNULL(Комплект.Анилокс.ОбъемЯчейки, 0) КАК ОбъемЯчейки,
		|	Комплект.ПроцентПечати,
		|	Комплект.Номенклатура,
		|	ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, -999) КАК КСухойОстаток
		|ИЗ
		|	Справочник.мн_Дизайны.КлишеЛицо КАК Комплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО Комплект.Номенклатура = ЗначенияСвойствОбъектов.Объект
		|			И (ЗначенияСвойствОбъектов.Свойство = &СухойОстаток)
		|ГДЕ
		|	Комплект.Ссылка = &Дизайн
		|	И Комплект.ВидКлише <> ЗНАЧЕНИЕ(Справочник.мн_ЦветаКлишеДизайнов.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Дизайн", Дизайн);
	Запрос.УстановитьПараметр("СухойОстаток", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("ЦБ000000015"));
	
	Если ЛицоОборот = Перечисления.мн_НанесениеПечати.Оборот Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Справочник.мн_Дизайны.КлишеЛицо","Справочник.мн_Дизайны.КлишеОборот");	
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		РасходЦвета = Выборка.ОбъемЯчейки * Выборка.ПроцентПечати / 100 / 4; 
		
		НормыРасходаКрасок.РасходКраски = НормыРасходаКрасок.РасходКраски + РасходЦвета;  
		
		РасходЦветаСО = РасходЦвета * Выборка.КСухойОстаток; 
		
		НормыРасходаКрасок.РасходКраскиСухойОстаток = НормыРасходаКрасок.РасходКраскиСухойОстаток + РасходЦветаСО;

	КонецЦикла;
	
	Если НормыРасходаКрасок.РасходКраскиСухойОстаток < 0 Тогда
		НормыРасходаКрасок.РасходКраскиСухойОстаток = 0;	
	КонецЕсли;
	
	Возврат НормыРасходаКрасок;
	
КонецФункции // РасчетРасходаКраски()

Функция ПолучитьСоставКрасокСекций(Дизайн, ЛицоОборот = Неопределено)Экспорт 
	
	Если ЛицоОборот = Неопределено Тогда
		ЛицоОборот = Перечисления.мн_НанесениеПечати.Лицо;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Комплект.Секция КАК Секция,
		|	Комплект.НомерСтроки,
		|	Комплект.ВидКлише,
		|	ЕСТЬNULL(Комплект.Анилокс.ОбъемЯчейки, 0) КАК ОбъемЯчейки,
		|	Комплект.ПроцентПечати,
		|	Комплект.Номенклатура,
		|	ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, 0) КАК КСухойОстаток,
		|	Комплект.ХарактеристикаНоменклатуры
		|ИЗ
		|	Справочник.мн_Дизайны.КлишеЛицо КАК Комплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО Комплект.Номенклатура = ЗначенияСвойствОбъектов.Объект
		|			И (ЗначенияСвойствОбъектов.Свойство = &СухойОстаток)
		|ГДЕ
		|	Комплект.Ссылка = &Дизайн
		|	И Комплект.ВидКлише <> ЗНАЧЕНИЕ(Справочник.мн_ЦветаКлишеДизайнов.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Секция";
	
	Запрос.УстановитьПараметр("Дизайн", Дизайн);
	Запрос.УстановитьПараметр("СухойОстаток", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("ЦБ000000015"));
	
	Если ЛицоОборот = Перечисления.мн_НанесениеПечати.Оборот Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Справочник.мн_Дизайны.КлишеЛицо","Справочник.мн_Дизайны.КлишеОборот");			
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКлише = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаКлише;
	
КонецФункции


//==============================================================

Функция ПолучитьДоступныеКлишеДизайна(Дизайн, ЛицоОборот = Неопределено) Экспорт 
	
	Если ЛицоОборот = Неопределено Тогда
		ЛицоОборот = Перечисления.мн_НанесениеПечати.Лицо;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ПечатныеФормыСрезПоследних.ЦветКлише КАК ЦветКлишеДизайна,
		|	ПечатныеФормыСрезПоследних.НомерКлише КАК НомерКлише,
		|	ПечатныеФормыСрезПоследних.Размещение,
		|	ПечатныеФормыСрезПоследних.Состояние
		|ИЗ
		|	РегистрСведений.мн_ПечатныеФормы.СрезПоследних(
		|			,
		|			ЦветКлише В
		|				(ВЫБРАТЬ
		|					КлишеДизайна.ВидКлише
		|				ИЗ
		|					Справочник.мн_Дизайны.КлишеЛицо КАК КлишеДизайна
		|				ГДЕ
		|					КлишеДизайна.Ссылка = &Дизайн)) КАК ПечатныеФормыСрезПоследних
		|ГДЕ
		|	ПечатныеФормыСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостояниеКлише.Годный)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПечатныеФормыСрезПоследних.ЦветКлише,
		|	НомерКлише
		|АВТОУПОРЯДОЧИВАНИЕ";
		
	Запрос.УстановитьПараметр("Дизайн",Дизайн);	
	
	Если ЛицоОборот = Перечисления.мн_НанесениеПечати.Оборот Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"КлишеЛицо","КлишеОборот");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
	
	Возврат РезультатЗапроса;
		
КонецФункции
