
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1,НаПринтер = Неопределено)Экспорт
	
	Если ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда
		
		//Для возможности печати внешних печатных форм
		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
		
		Если ТабДокумент = Неопределено Тогда
			Возврат
		КонецЕсли;
		
	Иначе
		
		ПараметрКоманды = Новый Массив;
		
		ПараметрКоманды.Добавить(Ссылка);
		
		Возврат;			
					
	КонецЕсли;
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер,, Ссылка);

КонецПроцедуры

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктПечатныхФорм = Новый Структура;
	
	СтруктПечатныхФорм.Вставить("Паспорт",   "Паспорт печатных форм");
	
	Возврат СтруктПечатныхФорм;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Процедура СформироватьИдентификатор() Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	Дизайны.ИД КАК ИД
		|ИЗ
		|	Справочник.мн_Дизайны КАК Дизайны
		|ГДЕ
		|	Дизайны.Владелец = &Владелец
		|	И ГОД(Дизайны.ДатаПоступления) = ГОД(&ДатаДизайна)
		|
		|СГРУППИРОВАТЬ ПО
		|	Дизайны.ИД
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИД УБЫВ";
					
	Запрос.Параметры.Вставить("Владелец", Владелец);
	
	Запрос.Параметры.Вставить("ДатаДизайна",ДатаДизайна); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		
		Выборка.Следующий();
		
		СтрИД = Выборка.ИД;
		
		Если СтрИД = Неопределено или СтрИД = "" Тогда
			
			Номер = 1;
			
		Иначе
			
			СтрПоиска = СокрП(Владелец.Код)+"-"+Формат(ТекущаяДата(),"ДФ=г")+"-";
			
			Номер = СтрЗаменить(СтрИД,СтрПоиска,"");
			
			Номер = Число(Номер)+ 1;
			
		КонецЕсли;		
		
	Иначе 
		
		Номер = 1;
		
	КонецЕсли;
	
	ИД = СокрП(Владелец.Код)+"-"+Формат(ТекущаяДата(),"ДФ=г")+"-"+Формат(Номер,"ЧЦ=2; ЧВН=");  
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	//ИД не копируется	
	ИД                = "";
	ДатаДизайна       = ТекущаяДата();
	Макет             = "";
	Ответственный     = ПараметрыСеанса.ТекущийПользователь;
	Менеджер          = ПараметрыСеанса.ТекущийПользователь;
	КлишеЛицо.Очистить();
	КлишеОборот.Очистить();
	КолвоКлишеОборот  = 0;
	КолвоКлишеЛицо  = 0;

	Архивный          = Ложь;
	Примечание        = "";
	
	ТипКлише = "";
	ТолщинаКлише = "";
	ПриводныеЭлементы = "";
	КоэффициентДисторсии = "";
	Линиатура = "";
	АдресКО = "";
	УровеньКонтроля = Перечисления.УровеньКонтроля.ПустаяСсылка();
	
	ШиринаТиражногоМатериала = "";
//	НаправлениеПечати = Перечисления.НаправлениеПечати.ПустаяСсылка();
	СхемаНаклейкиМетка = "";
	СхемаНаклейки = "";
	СхемаНаклейкиТекстПослеПечати = "";
	
	ТипПечати = Перечисления.мн_КоличествоОпераций.ПустаяСсылка();
	ПримечаниеПечати = "";
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ИД) Тогда
	
		ИД = Прав(СокрЛП(Владелец.Код),5)+"-"+ Код;
	
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() Тогда
	   УстановитьНовыйКод();
   	КонецЕсли;
   
	Наименование = НазваниеДизайна +" ("+Код+ " от "+Формат(ДатаДизайна,"ДФ=dd.MM.yy")+")";
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	//Заполнить ответственного
	ТолщинаКлише = 1.14;
	Ответственный  = ПараметрыСеанса.ТекущийПользователь; 

КонецПроцедуры
