
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.БИТ_Карантин.Очистить();
	Движения.БИТ_Карантин.Записать();
	// регистр БИТ_Карантин
	Движения.БИТ_Карантин.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.БИТ_Карантин.Добавить();
		Если ТекСтрокаТовары.Количество>0 Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Количество = ТекСтрокаТовары.Количество;
		Иначе
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Количество = - ТекСтрокаТовары.Количество;
		КонецЕсли;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Серия = ТекСтрокаТовары.Серия;
		Движение.Склад = Склад;
        Движение.Организация = Организация;
    КонецЦикла;
    
    Движения.БИТ_СертификацияОстатки.Очистить();
    Движения.БИТ_СертификацияОстатки.Записать();
    // регистр БИТ_СертификацияОстатки Приход
    Движения.БИТ_СертификацияОстатки.Записывать = Истина;
    Для Каждого ТекСтрокаТовары Из Товары Цикл
        Если ТекСтрокаТовары.Количество<0  Тогда
            Движение = Движения.БИТ_СертификацияОстатки.Добавить();
            Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
            Движение.Количество = - ТекСтрокаТовары.Количество;
            Движение.Период = Дата;
            Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
            Движение.Серия = ТекСтрокаТовары.Серия;
            Движение.Склад = Склад;
            Движение.Организация = Организация;
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры
