
&НаСервере
Функция  ЗаполнитьСтроку(Сертификат)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
    |   БИТ_СертификацияНоменклатуры.Количество КАК Количество,
    |   БИТ_СертификацияНоменклатуры.Номенклатура КАК Номенклатура,
    |   БИТ_СертификацияНоменклатуры.Серия КАК Серия,
    |   БИТ_СертификацияНоменклатуры.Склад КАК Склад
    |ИЗ
    |   Документ.БИТ_СертификацияНоменклатуры КАК БИТ_СертификацияНоменклатуры
    |ГДЕ
    |   БИТ_СертификацияНоменклатуры.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Сертификат);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ДанныеСтр = Новый Структура;
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ДанныеСтр.Вставить("Количество",ВыборкаДетальныеЗаписи.Количество);
		ДанныеСтр.Вставить("Номенклатура",ВыборкаДетальныеЗаписи.Номенклатура);
		ДанныеСтр.Вставить("Серия",ВыборкаДетальныеЗаписи.Серия);
		ДанныеСтр.Вставить("Склад",ВыборкаДетальныеЗаписи.Склад);
	КонецЕсли;
	Возврат ДанныеСтр;
КонецФункции
&НаКлиенте
Процедура СерииНоменклатурыСертификатПриИзменении(Элемент)
	ТекСтр = Элементы.СерииНоменклатуры.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтр.Сертификат) Тогда
		ДанныеСтроки = ЗаполнитьСтроку(ТекСтр.Сертификат); 
		ТекСтр.Количество = ДанныеСтроки.Количество;
		ТекСтр.Номенклатура = ДанныеСтроки.Номенклатура;
		ТекСтр.Серия  = ДанныеСтроки.Серия;
        ТекСтр.Склад  = ДанныеСтроки.Склад;
	Иначе
		ТекСтр.Количество = 0;
	КонецЕсли;
КонецПроцедуры
