
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    ЗаполнитьЗаявкиНаСертификациюСрв(ПараметрКоманды);	
    
    ПараметрыОтбора = Новый Структура;
    ПараметрыОтбора.Вставить("ДокументОснование", ПараметрКоманды);
    
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
    ОткрытьФорму("Документ.БИТ_ЗаявкаНаСертификацию.ФормаСписка",ПараметрыФормы);
    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаявкиНаСертификациюСрв(Ссылка)
    Для каждого стр из Ссылка.Товары Цикл
        Если стр.Номенклатура.БИТ_ТребуетсяВнутренняяСертификация Тогда
            ДокЗаявкаНаСертификацию = Документы.БИТ_ЗаявкаНаСертификацию.СоздатьДокумент();
            СтруктураЗаполнения = Новый Структура;
            СтруктураЗаполнения.Вставить("стр", стр);
            СтруктураЗаполнения.Вставить("Ссылка",Ссылка);
            ДокЗаявкаНаСертификацию.Заполнить(СтруктураЗаполнения);
            Попытка
                ДокЗаявкаНаСертификацию.Записать(РежимЗаписиДокумента.Проведение);
            Исключение
                Продолжить;
            КонецПопытки;
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

