
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОтборПоВладельцу(Команда)
	
	ПолеКомпановки = Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементыОтбора = Список.Отбор.Элементы;
	
	Для каждого Элемент из ЭлементыОтбора Цикл	
		
		Если Элемент.ЛевоеЗначение = ПолеКомпановки Тогда
			Элемент.Использование = НЕ Элемент.Использование;	
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеДизайнаПриИзменении(Элемент)
	
	//ПоискПоНаименованиюДизайна();
		
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоНаименованиюДизайна()

	Перем ЭлементОтбора;
	ПолеКомпановки = Новый ПолеКомпоновкиДанных("НазваниеДизайна");

	Для Каждого Эл из Список.Отбор.Элементы Цикл
		Если Эл.ЛевоеЗначение = ПолеКомпановки Тогда

			ЭлементОтбора = Эл;	
			Прервать;
			
		КонецЕсли;		
	КонецЦикла;
	
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
		ЭлементОтбора.ЛевоеЗначение = ПолеКомпановки;
	КонецЕсли;
	
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение = НаименованиеДизайна;
	
	//Если ЗначениеЗаполнено(НаименованиеДизайна)Тогда
	//	ЭлементОтбора.Использование = Истина;
	//Иначе
	//	ЭлементОтбора.Использование = Ложь;		
	//КонецЕсли;
	
	ЭлементОтбора.Использование = Истина;

КонецПроцедуры // ПоискПоНаименованиюДизайна()
