
&НаКлиенте
Процедура Заполнить(Команда)
	Объект.Товары.Очистить();
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Остатки.Номенклатура КАК Номенклатура,
		                      |	Остатки.Характеристика КАК Характеристика,
		                      |	Остатки.Серия КАК Серия,
		                      |	Остатки.Назначение КАК Назначение,
		                      |	СУММА(Остатки.КоличествоОстаток) КАК КоличествоОстаток
		                      |ПОМЕСТИТЬ ОстаткиОтправителя
		                      |ИЗ
		                      |	(ВЫБРАТЬ
		                      |		Остатки.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		                      |		Остатки.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
		                      |		Остатки.АналитикаУчетаНоменклатуры.Серия КАК Серия,
		                      |		Остатки.АналитикаУчетаНоменклатуры.Назначение КАК Назначение,
		                      |		СУММА(Остатки.КоличествоОстаток) КАК КоличествоОстаток
		                      |	ИЗ
		                      |		РегистрНакопления.ТоварыОрганизаций.Остатки(
		                      |				&Граница,
		                      |				Организация = &ОрганизацияОтправитель
		                      |					И АналитикаУчетаНоменклатуры.МестоХранения = &Склад
		                      |					И ВидЗапасов.ТипЗапасов В (&ДоступныеТипыЗапасов)
		                      |					И (ВидЗапасов.ВладелецТовара = &ВладелецТовара
		                      |						ИЛИ &ПоВсемВладельцам)) КАК Остатки
		                      |	ГДЕ
		                      |		НЕ(Остатки.АналитикаУчетаНоменклатуры.Номенклатура.ПодакцизныйТовар
		                      |					И &СкрыватьПодакцизныеТовары)
		                      |	
		                      |	СГРУППИРОВАТЬ ПО
		                      |		Остатки.АналитикаУчетаНоменклатуры.Номенклатура,
		                      |		Остатки.АналитикаУчетаНоменклатуры.Характеристика,
		                      |		Остатки.АналитикаУчетаНоменклатуры.Серия,
		                      |		Остатки.АналитикаУчетаНоменклатуры.Назначение
		                      |	
		                      |	ОБЪЕДИНИТЬ ВСЕ
		                      |	
		                      |	ВЫБРАТЬ
		                      |		Остатки.АналитикаУчетаНоменклатуры.Номенклатура,
		                      |		Остатки.АналитикаУчетаНоменклатуры.Характеристика,
		                      |		Остатки.АналитикаУчетаНоменклатуры.Серия,
		                      |		Остатки.АналитикаУчетаНоменклатуры.Назначение,
		                      |		СУММА(Остатки.КоличествоОстаток)
		                      |	ИЗ
		                      |		РегистрНакопления.РезервыТоваровОрганизаций.Остатки(
		                      |				&Граница,
		                      |				Организация = &ОрганизацияОтправитель
		                      |					И АналитикаУчетаНоменклатуры.МестоХранения = &Склад
		                      |					И ВидЗапасов.ТипЗапасов В (&ДоступныеТипыЗапасов)
		                      |					И (ВидЗапасов.ВладелецТовара = &ВладелецТовара
		                      |						ИЛИ &ПоВсемВладельцам)) КАК Остатки
		                      |	ГДЕ
		                      |		НЕ(Остатки.АналитикаУчетаНоменклатуры.Номенклатура.ПодакцизныйТовар
		                      |					И &СкрыватьПодакцизныеТовары)
		                      |	
		                      |	СГРУППИРОВАТЬ ПО
		                      |		Остатки.АналитикаУчетаНоменклатуры.Номенклатура,
		                      |		Остатки.АналитикаУчетаНоменклатуры.Характеристика,
		                      |		Остатки.АналитикаУчетаНоменклатуры.Серия,
		                      |		Остатки.АналитикаУчетаНоменклатуры.Назначение) КАК Остатки
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	Остатки.Номенклатура,
		                      |	Остатки.Характеристика,
		                      |	Остатки.Серия,
		                      |	Остатки.Назначение
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ОстаткиОтправителя.Номенклатура КАК Номенклатура,
		                      |	ОстаткиОтправителя.Серия КАК Серия,
		                      |	СУММА(ОстаткиОтправителя.КоличествоОстаток) КАК Количество
		                      |ИЗ
		                      |	ОстаткиОтправителя КАК ОстаткиОтправителя
		                      |ГДЕ
		                      |	НЕ &ОтрицательныеОстатки
		                      |	И ОстаткиОтправителя.Серия.бит_Качество
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	ОстаткиОтправителя.Номенклатура,
		                      |	ОстаткиОтправителя.Серия
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	ОстаткиОтправителя.Номенклатура,
		                      |	ОстаткиОтправителя.Серия,
		                      |	СУММА(-ОстаткиОтправителя.КоличествоОстаток)
		                      |ИЗ
		                      |	ОстаткиОтправителя КАК ОстаткиОтправителя
		                      |ГДЕ
		                      |	НЕ &ОтрицательныеОстатки
		                      |	И ОстаткиОтправителя.Серия.бит_Качество
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	ОстаткиОтправителя.Номенклатура,
		                      |	ОстаткиОтправителя.Серия
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	ОстаткиОтправителя.Номенклатура,
		                      |	ОстаткиОтправителя.Серия,
		                      |	СУММА(ОстаткиОтправителя.КоличествоОстаток)
		                      |ИЗ
		                      |	ОстаткиОтправителя КАК ОстаткиОтправителя
		                      |ГДЕ
		                      |	НЕ &ОтрицательныеОстатки
		                      |	И НЕ ОстаткиОтправителя.Серия.бит_Качество
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	ОстаткиОтправителя.Номенклатура,
		                      |	ОстаткиОтправителя.Серия
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	Номенклатура,
		                      |	Серия
		                      |АВТОУПОРЯДОЧИВАНИЕ");
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ОрганизацияОтправитель", Объект.Организация);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Запрос.УстановитьПараметр("ОтрицательныеОстатки", Ложь);
	Запрос.УстановитьПараметр("СкрыватьПодакцизныеТовары", Ложь);
	Запрос.УстановитьПараметр("ОблагаетсяНДСУПокупателя", Ложь);
	
	ДоступныеТипыЗапасов = Новый Массив();
	ВладелецТовара = Неопределено;
	
	ДоступныеТипыЗапасов.Добавить(Перечисления.ТипыЗапасов.КомиссионныйТовар);
	ДоступныеТипыЗапасов.Добавить(Перечисления.ТипыЗапасов.Товар);
	ДоступныеТипыЗапасов.Добавить(Перечисления.ТипыЗапасов.ТоварНаХраненииСПравомПродажи);
	Запрос.УстановитьПараметр("ДоступныеТипыЗапасов", ДоступныеТипыЗапасов);
	Запрос.УстановитьПараметр("ВладелецТовара", ВладелецТовара);
	Запрос.УстановитьПараметр("ПоВсемВладельцам", Не ЗначениеЗаполнено(ВладелецТовара));
	
	ДатаЗаполнения = ?(ЗначениеЗаполнено(Объект.Дата), КонецДня(Объект.Дата), ТекущаяДатаСеанса());
	Граница = Новый Граница(ДатаЗаполнения, ВидГраницы.Включая);
	Запрос.УстановитьПараметр("Граница", Граница);
	
	Результат = Запрос.Выполнить();
	Объект.Товары.Загрузить(Результат.Выгрузить());

КонецПроцедуры
